src/test/java/features/requests/save_request_detective.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:detectiveServiceRequest>
            <gs:detective>
                <gs:firstName>@@firstname@@</gs:firstName>
                <gs:lastName>@@lastname@@</gs:lastName>
                <gs:rank>@@rank@@</gs:rank>
            </gs:detective>
        </gs:detectiveServiceRequest>
    </soapenv:Body>
</soapenv:Envelope>